# Реализуйте алгоритм перемешивания списка (shuffle использовать нельзя, другие методы из библиотеки random - можно).

import random
  
list = [2, 5, 8, 9, 12]
print("random.sample() ", random.sample(list,3))